ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/msp/mspm0gx218_gx207/LFSS_1.0.xml
    <register id="LFSS_TSMON" width="32" offset="0x1160" description="Time Stamp Month Register - Calendar Mode With Binary / BCD Format">
        <bitfield id="MONBIN" description="Time Stamp Month Binary (1 to 12). If RTCBCD=1 write to these bits will be ignored and read give the value 0." begin="3" end="0" width="4" rwaccess="R">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0xC" description="Highest possible value"/>
        </bitfield>
        <bitfield id="MONLOWBCD" description="Time Stamp Month BCD  low digit (0 to 9). If RTCBCD=0 write to these bits will be ignored and read give the value 0." begin="11" end="8" width="4" rwaccess="R">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0x9" description="Highest possible value"/>
        </bitfield>
        <bitfield id="MONHIGHBCD" description="Time Stamp Month BCD  high digit (0 or 1). If RTCBCD=0 write to these bits will be ignored and read give the value 0." begin="12" end="12" width="1" rwaccess="R">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0x1" description="Highest possible value"/>
        </bitfield>
    </register>
    <register id="LFSS_TSYEAR" width="32" offset="0x1164" description="Time Stamp Years Register - Calendar Mode With Binary / BCD Format">
        <bitfield id="YEARLOWBIN" description="Time Stamp Year Binary  low byte. Valid values for Year are 0 to 4095. If RTCBCD=1 write to these bits will be ignored and read give the value 0." begin="7" end="0" width="8" rwaccess="R">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0xFF" description="Highest possible value"/>
        </bitfield>
        <bitfield id="YEARHIGHBIN" description="Time Stamp Year Binary  high byte. Valid values for Year are 0 to 4095. If RTCBCD=1 write to these bits will be ignored and read give the value 0." begin="11" end="8" width="4" rwaccess="R">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0xF" description="Highest possible value"/>
        </bitfield>
        <bitfield id="YEARLOWESTBCD" description="Time Stamp Year BCD  lowest digit (0 to 9). If RTCBCD=0 write to these bits will be ignored and read give the value 0." begin="19" end="16" width="4" rwaccess="R">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0x9" description="Highest possible value"/>
        </bitfield>
        <bitfield id="DECADEBCD" description="Time Stamp Decade BCD (0 to 9). If RTCBCD=0 write to these bits will be ignored and read give the value 0." begin="23" end="20" width="4" rwaccess="R">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0x9" description="Highest possible value"/>
        </bitfield>
        <bitfield id="CENTLOWBCD" description="Time Stamp Century BCD  low digit (0 to 9). If RTCBCD=0 write to these bits will be ignored and read give the value 0." begin="27" end="24" width="4" rwaccess="R">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0x9" description="Highest possible value"/>
        </bitfield>
        <bitfield id="CENTHIGHBCD" description="Time Stamp Century BCD  high digit (0 to 4). If RTCBCD=0 write to these bits will be ignored and read give the value 0." begin="30" end="28" width="3" rwaccess="R">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0x4" description="Highest possible value"/>
        </bitfield>
    </register>
    <register id="LFSS_TSSTAT" width="32" offset="0x1168" description="Time Stamp Status Register">
        <bitfield id="TSTIOEVT0" description="Tamper I/O 0 caused time stamp event" begin="0" end="0" width="1" rwaccess="R">
            <bitenum id="CLR" value="0x0" description="no event detected"/>
            <bitenum id="SET" value="0x1" description="event detected"/>
        </bitfield>
        <bitfield id="TSVDDEVT" description="Loss of VDD caused time stamp event" begin="16" end="16" width="1" rwaccess="R">
            <bitenum id="CLR" value="0x0" description="no event detected"/>
            <bitenum id="SET" value="0x1" description="event detected"/>
        </bitfield>
    </register>
    <register id="LFSS_TSCTL" width="32" offset="0x116C" description="Time Stamp Control Register">
        <bitfield id="TSTIOEN0" description="Time Stamp by Tamper I/O 0 enable" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="function disabled"/>
            <bitenum id="ENABLE" value="0x1" description="function enabled"/>
        </bitfield>
        <bitfield id="TSVDDEN" description="Time Stamp by VDD Loss detection enable" begin="16" end="16" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="function disabled"/>
            <bitenum id="ENABLE" value="0x1" description="function enabled"/>
        </bitfield>
        <bitfield id="TSCAPTURE" description="Defines the capture method of the RTC timestamp when a time stamp event occurens." begin="20" end="20" width="1" rwaccess="R/W">
            <bitenum id="FIRST" value="0x0" description="Time stamp holds RTC capture at first occurrence of time stamp event."/>
            <bitenum id="LAST" value="0x1" description="Time stamp holds RTC capture at last occurrence of time stamp event."/>
        </bitfield>
    </register>
    <register id="LFSS_TSCLR" width="32" offset="0x1170" description="Time Stamp Clear Register">
        <bitfield id="CLR" description="Clear time stamp and status register." begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect"/>
            <bitenum id="CLR" value="0x1" description="clear time stamp event"/>
        </bitfield>
    </register>
    <register id="LFSS_LFSSRST" width="32" offset="0x11F0" description="Low frequency sub-system reset request">
        <bitfield id="VBATPOR" description="If set, the register bit will request a power on reset to the PMU of the LFSS." begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description="Writing this value has no effect."/>
            <bitenum id="SET" value="0x1" description="Request power on reset to the LFSS."/>
        </bitfield>
    </register>
    <register id="LFSS_RTCLOCK" width="32" offset="0x11FC" description="Real time clock lock register">
        <bitfield id="PROTECT" description="If set, the register bit will protect the CLKCTL, SEC, MIN, HOUR, DAY, MON, YEAR and LFSSRST from accidental writes." begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="CLR" value="0x0" description="RTC counter is writable."/>
            <bitenum id="SET" value="0x1" description="RTC counter is read only access."/>
        </bitfield>
    </register>
    <register id="LFSS_TIOCTL" width="32" offset="0x1200" description="Tamper I/O Control Register">
        <bitfield id="IOMUX" description="tamper I/O is controlled by SoC IOMUX module" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="IOMUX" value="0x0" description="The tamper I/O is controlled by the IOMUX of the SoC and does allow assignment to a peripheral function. In the case the main supply (VDD) is lost, this I/O will go into a Hi-Z state."/>
            <bitenum id="TAMPER" value="0x1" description="The tamper I/O is controlled by the TIOCTL register and stays functional during loss of the main supply (VDD)."/>
        </bitfield>
        <bitfield id="PIPD" description="pull down enable" begin="16" end="16" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="The pull-down function is disabled."/>
            <bitenum id="ENABLE" value="0x1" description="The pull-down function is enabled."/>
        </bitfield>
        <bitfield id="PIPU" description="pull up enable" begin="17" end="17" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="The pull-up function is disabled."/>
            <bitenum id="ENABLE" value="0x1" description="The pull-up function is enabled."/>
        </bitfield>
        <bitfield id="INENA" description="input enable" begin="18" end="18" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="The input path is disabled."/>
            <bitenum id="ENABLE" value="0x1" description="The input path is enabled."/>
        </bitfield>
        <bitfield id="POLARITY" description="Enables and configures edge detection polarity for TIO" begin="9" end="8" width="2" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Edge detection disabled"/>
            <bitenum id="RISE" value="0x1" description="Detects rising edge of input event"/>
            <bitenum id="FALL" value="0x2" description="Detects falling edge of input event"/>
            <bitenum id="BOTH" value="0x3" description="Detects both rising and falling edge of input event"/>
        </bitfield>
        <bitfield id="FILTEREN" description="Programmable counter length of digital glitch filter for TIO0" begin="13" end="12" width="2" rwaccess="R/W">
            <bitenum id="NO_FLT" value="0x0" description="no filter on the tamper I/O beyond CDC synchronization sample"/>
            <bitenum id="FLT_1" value="0x1" description="1 FLCLK minimum sample (30us)"/>
            <bitenum id="FLT_2" value="0x2" description="3 LFCLK minimum sample (100us)"/>
            <bitenum id="FLT_3" value="0x3" description="6 LFCLK minimum sample (200us)"/>
        </bitfield>
        <bitfield id="TOUTSEL" description="Selects the source for TOUT control" begin="5" end="4" width="2" rwaccess="R/W">
            <bitenum id="TOUT" value="0x0" description="The TOUT register is the source for TOUT"/>
            <bitenum id="LFCLKEXT" value="0x1" description="The LFCLK is the source for TOUT"/>
            <bitenum id="HEARTBEAT" value="0x2" description="The heart beat generatore is the source for TOUT"/>
            <bitenum id="TSEVTSTAT" value="0x3" description="The time stamp event status is the source for TOUT"/>
        </bitfield>
        <bitfield id="OUTINV" description="Output inversion enable" begin="19" end="19" width="1" rwaccess="R/W">
            <bitenum id="DISBALE" value="0x0" description="The output inversion is disabled."/>
            <bitenum id="ENABLE" value="0x1" description="The output inversion is enabled."/>
        </bitfield>
    </register>
    <register id="LFSS_TOUT3_0" width="32" offset="0x1280" description="Tamper Output 3 to 0">
        <bitfield id="TIO0" description="This bit sets the value of the pin tamper I/O 0 (TIO0) when the output is enabled through TOE0 register." begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="ZERO" value="0x0" description="Output is set to 0"/>
            <bitenum id="ONE" value="0x1" description="Output is set to 1"/>
        </bitfield>
    </register>
    <register id="LFSS_TOE3_0" width="32" offset="0x1290" description="Tamper Output Enable 3 to 0">
        <bitfield id="TIO0" description="Enables data output for tamper I/O 0" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="output disabled"/>
            <bitenum id="ENABLE" value="0x1" description="output enabled"/>
        </bitfield>
    </register>
